TestPlans/Car/Sure Thing! Max/xml/STM3_15102014_2.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xs="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <tns:aggregateQuoteRequest xmlns:tns="http://schemas.cdlis.co.uk/aggregator/api/v3-8">
      <userid>CTM</userid>
      <password>tys82HS63BjS</password>
      <broker results="1">hastings-dir</broker>
      <broker results="1">hastings-ess</broker>
      <broker results="1">igi3</broker>
      <broker results="1">onequote</broker>
      <broker results="1">elite</broker>
      <broker results="1">virgin</broker>
      <broker results="1">esurebroker</broker>
      <broker results="1">sheilasbroker</broker>
      <broker results="1">hastings-prem</broker>
      <broker results="1">hastings-peoples</broker>
      <broker results="1">selecter-oyd</broker>
      <broker results="1">sagaselect</broker>
      <broker results="1">smartmiles</broker>
      <broker results="1">castlecover-ageas50</broker>
      <broker results="1">surething</broker>
      <broker results="1">igo4asp-santander</broker>
      <broker results="1">igo4asp-renault</broker>
      <broker results="1">insurewiser</broker>
      <broker results="1">coverbox</broker>
      <broker results="1">drivestyle</broker>
      <broker results="1">sheilaswheelsmd</broker>
      <broker results="1">SureThing-Max</broker>
      <policyType>PC</policyType>
      <returnNoQuotes>Y</returnNoQuotes>
      <store>true</store>
      <risk xsi:type="tns:privateCarRiskType">
        <policy>
          <inceptionDate>2014-10-19</inceptionDate>
          <frequency>A</frequency>
          <protectedBonus>N</protectedBonus>
          <cover>C</cover>
          <volXS>900</volXS>
          <restrict>ND</restrict>
          <totalMileage>4999</totalMileage>
          <classOfUse>SDPexC</classOfUse>
          <drivingExperience>
            <type>ND</type>
            <yearsClaimFree>0</yearsClaimFree>
          </drivingExperience>
        </policy>
        <proposer driverId="1">
          <name>
            <title>Mrs</title>
            <forenames>Barbara</forenames>
            <surname>Two</surname>
          </name>
          <gender>F</gender>
          <dateOfBirth>1980-02-02</dateOfBirth>
          <maritalStatus>V</maritalStatus>
          <residentSince>1980-02-02</residentSince>
          <insuranceRefused>N</insuranceRefused>
          <nonRtaConviction>N</nonRtaConviction>
          <fullTimeOccupation>
            <type>SE</type>
            <occCode>031</occCode>
            <empCode>250</empCode>
          </fullTimeOccupation>
          <claim claimId="1">
            <code>M051</code>
            <date>2012-05-01</date>
            <cost>0.00</cost>
            <thirdPartyCost>0</thirdPartyCost>
            <fault>N</fault>
            <personalInjury>N</personalInjury>
            <thisPolicy>N</thisPolicy>
          </claim>
          <licence>
            <type>A</type>
            <date>2013-03-01</date>
          </licence>
          <vehicleUse>M</vehicleUse>
          <accessToOtherVehicles>OOC</accessToOtherVehicles>
          <motoringOrg>NONE</motoringOrg>
          <smoker>Y</smoker>
          <address>
            <addressLine1>174 Partington Lane</addressLine1>
            <addressLine2>Swinton</addressLine2>
            <addressLine3>Manchester</addressLine3>
            <addressLine4></addressLine4>
            <postCode>M27 0WN</postCode>
            <abodeType>H</abodeType>
          </address>
          <daytimeTelephone>01733345678</daytimeTelephone>
          <eveningTelephone>01733345678</eveningTelephone>
          <email>oliver.neal@emailreaction.org</email>
        </proposer>
        <driver driverId="2">
          <name>
            <title>Mrs</title>
            <forenames>Betty</forenames>
            <surname>Two</surname>
          </name>
          <gender>F</gender>
          <dateOfBirth>1977-07-05</dateOfBirth>
          <maritalStatus>V</maritalStatus>
          <residentSince>1977-07-05</residentSince>
          <insuranceRefused>N</insuranceRefused>
          <nonRtaConviction>N</nonRtaConviction>
          <fullTimeOccupation>
            <type>SE</type>
            <occCode>B15</occCode>
            <empCode>246</empCode>
          </fullTimeOccupation>
          <claim claimId="2">
            <code>T003</code>
            <date>2011-09-01</date>
            <cost>0.00</cost>
            <thirdPartyCost>0</thirdPartyCost>
            <fault>Y</fault>
            <personalInjury>N</personalInjury>
            <thisPolicy>N</thisPolicy>
          </claim>
          <licence>
            <type>F</type>
            <date>2014-02-01</date>
          </licence>
          <vehicleUse>F</vehicleUse>
          <accessToOtherVehicles>NDOC</accessToOtherVehicles>
          <relationshipToProposer>V</relationshipToProposer>
        </driver>
        <vehicle>
          <regNumber>R974LGH</regNumber>
          <abiCode>04060903</abiCode>
          <yearOfManufacture>1997</yearOfManufacture>
          <whereKept>D</whereKept>
          <keeper>N</keeper>
          <owner>Civil</owner>
          <purchased>2013-07-01</purchased>
          <value>6000</value>
          <paid>6000</paid>
          <vehicleOthers>1</vehicleOthers>
          <LHD>Y</LHD>
          <ABS>N</ABS>
          <seats>2</seats>
          <modifications>
            <modified>N</modified>
          </modifications>
          <immob>FF93</immob>
          <alarm>FACT</alarm>
          <tracker>NONE</tracker>
        </vehicle>
        <duqs>
          <question number="11">N</question>
          <question number="15">Y</question>
          <question number="190">2013</question>
          <question number="266">A</question>
          <question number="40">WORK</question>
          <question number="579">ND</question>
          <question number="580">0</question>
          <question number="578">N</question>
          <question number="282">F</question>
          <question number="527">N</question>
          <question number="675">N</question>
          <question number="544">Y</question>
        </duqs>
      </risk>
      <brokerOptionalExtensions>
        <brokerOptionalExtension>
          <type>Premier Mandatory Bundle</type>
        </brokerOptionalExtension>
      </brokerOptionalExtensions>
    </tns:aggregateQuoteRequest>
  </soap:Body>
</soap:Envelope>